app/controllers/api/v1/parcels_controller.rb

      def index
        parcels = Parcel.all
---
SELECT "parcels".* FROM "parcels"

      def show
       @parcel = Parcel.where(user_id:params[:id] )
        render json: @parcel
       Parcel.destroy_by(user_id:params[:id])
---
SELECT "parcels".* FROM "parcels" WHERE "parcels"."user_id" = $1  [["user_id", 6]]
DELETE FROM "parcels" WHERE "parcels"."id" = $1  [["id", 17]]

      def create
        parcel = Parcel.new(create_parcel_params)

        if parcel.save
---
INSERT INTO "parcels" ("fname", "lname", "rfname", "rlname", "address1", "pincode1", "city1", "state1", "phone1", "address2", "pincode2", "city2", "state2", "phone2", "weight", "price", "accesstoken", "reference", "postType", "barcode", "postoffice", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24) RETURNING "id"

      def destroy
        if @parcel.destroy
---
DELETE FROM "parcels" WHERE "parcels"."id" = $1  [["id", 7]]