app/controllers/api/v1/parcelcopies_controller.rb

      def index
        parcelcopies = Parcelcopies.all
---
SELECT "parcelcopies".* FROM "parcelcopies"

      def create
        parcelcopies = Parcelcopies.new(create_parcelcopies_params)

        if parcelcopies.save
---
INSERT INTO "parcelcopies" ("fname", "lname", "rfname", "rlname", "address1", "pincode1", "city1", "state1", "phone1", "address2", "pincode2", "city2", "state2", "phone2", "weight", "price", "accesstoken", "reference", "postType", "barcode", "postoffice", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24) RETURNING "id"