app/controllers/api/v1/users_controller.rb

      def signup
        @user = User.new(signup_params)
        puts params
        if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at", "email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"